const apiRecommend = [
  {
    id: 1,
    user_id: {
      id: 2,
      email: 'te4@mail.ru',
      username: 'Эльвира',
      first_name: '',
      last_name: '',
    },
    сourse_id: [
      {
        id: 1,
        title: 'vzhgg',
        description: 'agaag',
        price: '34.00',
        modul_id: [
          {
            id: 1,
            title: 'afafaf',
            price: '34.00',
            length: 34,
            theme_id: [
              {
                id: 1,
                title: 'afgag',
                price: '34.00',
              },
            ],
          },
        ],
        level_id: {
          profession: 'UX/UI дизайнер',
          level: 'Junior',
        },
      },
      {
        id: 2,
        title: 'vzhgg',
        description: 'agaag',
        price: '34.00',
        modul_id: [
          {
            id: 2,
            title: 'afafaf',
            price: '34.00',
            length: 34,
            theme_id: [
              {
                id: 2,
                title: 'afgag',
                price: '34.00',
              },
            ],
          },
        ],
        level_id: {
          profession: 'UX/UI дизайнер',
          level: 'Junior',
        },
      },
      {
        id: 3,
        title: 'vzhgg',
        description: 'agaag',
        price: '34.00',
        modul_id: [
          {
            id: 3,
            title: 'afafaf',
            price: '34.00',
            length: 34,
            theme_id: [
              {
                id: 3,
                title: 'afgag',
                price: '34.00',
              },
            ],
          },
        ],
        level_id: {
          profession: 'UX/UI дизайнер',
          level: 'Junior',
        },
      },
      {
        id: 4,
        title: 'vzhgg',
        description: 'agaag',
        price: '34.00',
        modul_id: [
          {
            id: 4,
            title: 'afafaf',
            price: '34.00',
            length: 34,
            theme_id: [
              {
                id: 4,
                title: 'afgag',
                price: '34.00',
              },
            ],
          },
        ],
        level_id: {
          profession: 'UX/UI дизайнер',
          level: 'Junior',
        },
      },
      {
        id: 5,
        title: 'vzhgg',
        description: 'agaag',
        price: '34.00',
        modul_id: [
          {
            id: 5,
            title: 'afafaf',
            price: '34.00',
            length: 34,
            theme_id: [
              {
                id: 5,
                title: 'afgag',
                price: '34.00',
              },
            ],
          },
        ],
        level_id: {
          profession: 'UX/UI дизайнер',
          level: 'Junior',
        },
      },
      {
        id: 6,
        title: 'vzhgg',
        description: 'agaag',
        price: '34.00',
        modul_id: [
          {
            id: 6,
            title: 'afafaf',
            price: '34.00',
            length: 34,
            theme_id: [
              {
                id: 6,
                title: 'afgag',
                price: '34.00',
              },
            ],
          },
        ],
        level_id: {
          profession: 'UX/UI дизайнер',
          level: 'Junior',
        },
      },
      {
        id: 7,
        title: 'vzhgg',
        description: 'agaag',
        price: '34.00',
        modul_id: [
          {
            id: 7,
            title: 'afafaf',
            price: '34.00',
            length: 34,
            theme_id: [
              {
                id: 7,
                title: 'afgag',
                price: '34.00',
              },
            ],
          },
        ],
        level_id: {
          profession: 'UX/UI дизайнер',
          level: 'Junior',
        },
      },
      {
        id: 8,
        title: 'vzhgg',
        description: 'agaag',
        price: '34.00',
        modul_id: [
          {
            id: 8,
            title: 'afafaf',
            price: '34.00',
            length: 34,
            theme_id: [
              {
                id: 8,
                title: 'afgag',
                price: '34.00',
              },
            ],
          },
        ],
        level_id: {
          profession: 'UX/UI дизайнер',
          level: 'Junior',
        },
      },
      {
        id: 1,
        title: 'vzhgg',
        description: 'agaag',
        price: '34.00',
        modul_id: [
          {
            id: 1,
            title: 'afafaf',
            price: '34.00',
            length: 34,
            theme_id: [
              {
                id: 1,
                title: 'afgag',
                price: '34.00',
              },
            ],
          },
        ],
        level_id: {
          profession: 'UX/UI дизайнер',
          level: 'Junior',
        },
      },
    ],
    pract_id: [
      {
        id: 1,
        title: 'sgsgz',
        url: 'https://career.habr.com/',
        level_id: {
          profession: 'UX/UI дизайнер',
          level: 'Junior',
        },
      },
    ],
    links_id: [
      {
        id: 1,
        title: 'zggzsg',
        url: 'https://career.habr.com/',
        level_id: {
          profession: 'UX/UI дизайнер',
          level: 'Junior',
        },
      },
    ],
  },
];

export const statisticsApiTest = [
  {
    id: 1,
    user_id: {
      id: 2,
      email: 'te4@mail.ru',
      username: 'Эльвира',
      first_name: '',
      last_name: '',
    },
    level_id: {
      profession: 'UX/UI дизайнер +',
      level: 'Middle',
    },
    skill_id: [
      {
        id: 10,
        name: 'UI-дизайн',
        description:
          '* UI-дизайн (User Interface - ""пользовательский интерфейс"") отвечает за то, как интерфейс выглядит. * Задачи: 1. Определять цветовую гамму, шрифты, размер элементов. 2. Разрабатывать фирменный стиль бренда, UI-кит, дизайн-систему. 3. Адаптировать все элементы интерфейса под разные устройства. 4. Готовить анимацию и статичные элементы - изображения, таблицы, кнопки, слайдеры, формы."',
        skill_percent: 47,
      },
      {
        id: 9,
        name: 'UX-исследования',
        description:
          '* UX (User Experience - пользовательский опыт) отвечает за то, как интерфейс работает. * UX-исследования - это инструмент, который помогает команде понять потребности пользователей продукта (их чувства, эмоции, мотивы поведения). * Цель UX-анализа - выявить барьеры и слабые места, а затем исправить их: устранить несоответствие между ожиданиями пользователя и функциональностью продукта, снизить когнитивную нагрузку и сократить путь достижения цели. * Всё это помогает улучшать экономические показатели.',
        skill_percent: 36,
      },
      {
        id: 16,
        name: 'Автономность',
        description:
          '* Продолжать учиться и развиватся, как специалист с своей области. * Задачи: 1. Самостоятельно нарабатывать насмотренность. 2. Активно изучать литературу, знать популярных дизайнеров. 3. Участвовать челленджах, хакатонах и других дизайнерских активностях. 4. Получать обратную связь, уметь делать выводы. 5. Выявлять пробелы в своих навыках. Честно признаваться себе, в чем вы сильны, а над чем еще предстоит поработать. 6. Находить наставника, что поможет выявить свои слабые стороны и предоставить ресурсы и возможности для их развития.',
        skill_percent: 40,
      },
      {
        id: 11,
        name: 'Инструменты',
        description:
          '* Figma - приложение, используемое для выполнения всех видов графических работ: от создания макетов сайтов до разработки интерфейсов мобильных приложений и прототипировния. * Задачи: 1. Прототипировать, понимать важность прототипа и уместность его использования. 2. Создавать анимацию так, чтобы команде разработки было понятно.',
        skill_percent: 60,
      },
      {
        id: 13,
        name: 'Коммуникация',
        description:
          '* Укрепление доверия, эффективное разъяснение своих дизайн-решений, учитывая потребности заинтересованных сторон. * Задачи: 1. Уметь презентовать свой опыт/работу. 2. Системно выстраивать свою речь. 3. Вести прозрачную, своевременную и логичную коммуникацию - вовремя предупреждать о проблемах, сдвигающихся сроках. 4. Общаться с клиентом напрямую: участвовать или проводить самому бриф с заказчиком. Уметь презентовать решения.',
        skill_percent: 31,
      },
      {
        id: 15,
        name: 'Пипл-менеджмент',
        description:
          '* Продолжать учиться и развиваться, как специалист в своей области. * Задачи: 1. Уметь оценить масштаб работы над проектом. 2. Делегировать часть работы специалисту уровня junior в соответствии с его навыками. 3. Оценить колчество времени, затраченного на выполнение и заменеджерить его.',
        skill_percent: 0,
      },
      {
        id: 14,
        name: 'Про-активность',
        description:
          '* Продолжать учиться и развиваться, как специалист в своей области. * Задачи: 1. Стабильно показывать результат в работе над текущими проектами. 2. Оценивать, сколько нужно времени на выполнение задачи и укладываться в поставленный срок.',
        skill_percent: 36,
      },
      {
        id: 12,
        name: 'Продукт',
        description:
          '* Ориентир на то, чтобы делать дизайн для людей и для бизнеса, улучшать продукты, чтобы чинить боли пользователей, чтобы помогать бизнесам расти и быть успешнее. * Задачи: 1. Собирать customer joutney и любой landing именно с точки зрения нужд продукта (определять боли клиента, конкурентные преимущества продукта), вывести на сайт в понятной структуре и логике. 2. Понимать, что решения влияют на метрики, учитывать это при работе. 3. Без упадка сил и потери мотивации убирать те дизайн-решения, которые не решают задач продукта. 4. Проводить интервью с пользователями под присмотром старшего специалиста.',
        skill_percent: 20,
      },
    ],
    goal: false,
    value: '52.5',
  },
  {
    id: 2,
    user_id: {
      id: 2,
      email: 'te4@mail.ru',
      username: 'Эльвира',
      first_name: '',
      last_name: '',
    },
    level_id: {
      profession: 'UX/UI дизайнер',
      level: 'Junior',
    },
    skill_id: [
      {
        id: 2,
        name: 'UI-дизайн',
        description:
          '* UI-дизайн (User Interface - "пользовательский интерфейс") отвечает за то, как интерфейс выглядит. * Задачи: 1. Определять цветовую гамму, шрифты, размер элементов. 2. Разрабатывать фирменный стиль бренда, UI-кит, дизайн-систему. 3. Адаптировать все элементы интерфейса под разные устройства. 4. Готовить анимацию и статичные элементы - изображения, таблицы, кнопки, слайдеры, формы.',
        skill_percent: 90,
      },
      {
        id: 1,
        name: 'UX-исследования',
        description:
          '* UX (User Experience - пользовательский опыт) отвечает за то, как интерфейс работает. * UX-исследования  - это инструмент, который помогает команде понять потребности пользователей продукта (их чувства, эмоции, мотивы поведения). * Цель UX-анализа - выявить барьеры и слабые места, а затем исправить их: устранить несоответствие между ожиданиями пользователя и функциональностью продукта, снизить когнитивную нагрузку и сократить путь достижения цели. * Всё это помогает улучшать экономические показатели.',
        skill_percent: 100,
      },
      {
        id: 6,
        name: 'Автономность',
        description:
          '* Продолжать учиться и развиватся, как специалист с своей области. * Задачи: 1. Самостоятельно нарабатывать насмотренность. 2. Активно изучать литературу, знать популярных дизайнеров. 3. Участвовать  челленджах, хакатонах и других дизайнерских активностях. 4. Получать обратную связь, уметь делать выводы. 5. Выявлять пробелы в своих навыках. Честно признаваться себе, в чем вы сильны, а над чем еще предстоит поработать. 6. Находить наставника, что поможет выявить свои слабые стороны и предоставить ресурсы и возможности для их развития.',
        skill_percent: 100,
      },
      {
        id: 3,
        name: 'Инструменты',
        description:
          '* Figma - приложение, используемое для выполнения всех видов графических работ: от создания макетов сайтов до разработки интерфейсов мобильных приложений и прототипировния. * Задачи: 1. Прототипировать, понимать важность прототипа и уместность его использования. 2. Создавать анимацию так, чтобы команде разработки было понятно.',
        skill_percent: 100,
      },
      {
        id: 5,
        name: 'Коммуникация',
        description:
          '* Укрепление доверия, эффективное разъяснение своих дизайн-решений, учитывая потребности заинтересованных сторон. * Задачи: 1. Уметь презентовать свой опыт/работу. 2. Системно выстраивать свою речь. 3. Вести прозрачную, своевременную и логичную коммуникацию - вовремя предупреждать о проблемах, сдвигающихся сроках. 4. Общаться с клиентом напрямую: участвовать или проводить самому бриф с заказчиком. Уметь презентовать решения.',
        skill_percent: 80,
      },
      {
        id: 8,
        name: 'Пипл-менеджмент',
        description:
          '* Продолжать учиться и развиваться, как специалист в своей области. * Задачи: 1. Уметь оценить масштаб работы над проектом. 2. Делегировать часть работы специалисту уровня junior в соответствии с его навыками. 3. Оценить колчество времени, затраченного на выполнение и заменеджерить его.',
        skill_percent: 0,
      },
      {
        id: 7,
        name: 'Про-активность',
        description:
          '* Продолжать учиться и развиваться, как специалист в своей области. * Задачи: 1. Стабильно показывать результат в работе над текущими проектами. 2. Оценивать, сколько нужно времени на выполнение задачи и укладываться в поставленный срок.',
        skill_percent: 0,
      },
      {
        id: 4,
        name: 'Продукт',
        description:
          '* Ориентир на то, чтобы делать дизайн для людей и для бизнеса, улучшать продукты, чтобы чинить боли пользователей, чтобы помогать бизнесам расти и быть успешнее. * Задачи: 1. Собирать customer joutney и любой landing именно с точки зрения нужд продукта (определять боли клиента, конкурентные преимущества продукта), вывести на сайт в понятной структуре и логике. 2. Понимать, что решения влияют на метрики, учитывать это при работе. 3. Без упадка сил и потери мотивации убирать те дизайн-решения, которые не решают задач продукта. 4. Проводить интервью с пользователями под присмотром старшего специалиста.',
        skill_percent: 100,
      },
    ],
    goal: false,
    value: '52.5',
  },
];

export const recomApi = [
  {
    id: 1,
    user_id: {
      id: 2,
      email: 'te4@mail.ru',
      username: 'Эльвира',
      first_name: '',
      last_name: '',
    },
    сourse_id: [
      {
        id: 1,
        title: 'Адаптивность',
        description: 'agaag',
        price: '0',
        modul_id: [
          {
            id: 1,
            title: 'Адаптивность',
            price: '0',
            length: 34,
            theme_id: [
              {
                id: 1,
                title: 'Адаптивность',
                price: '0',
              },
            ],
          },
        ],
        level_id: {
          profession: 'UX/UI дизайнер',
          level: 'Junior',
        },
      },
    ],
    pract_id: [
      {
        id: 1,
        title: 'Дизайн-спринт MasterMe',
        url: 'https://career.habr.com/',
        level_id: {
          profession: 'UX/UI дизайнер',
          level: 'Junior',
        },
      },
    ],
    links_id: [
      {
        id: 1,
        title: 'СТРОИМ CJM',
        url: 'https://career.habr.com/',
        level_id: {
          profession: 'UX/UI дизайнер',
          level: 'Junior',
        },
      },
    ],
  },
];
